Конфигурация/Catalogs/ПаевыеИнвестиционныеФонды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ПаевыеИнвестиционныеФонды</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПифовВЗависимостиОтЛиквидности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииПИФовВЗависимостиОтОбъектаИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПравил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПравил</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрекращения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганВыдавшийЛицензию</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РегуляторыРынкаЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганУтвердившийПравила</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РегуляторыРынкаЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыПИФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыПИФ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УправляющаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УправляющиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КраткоеНаименованиеФонда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеНаименованиеФонда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АгентскийДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскогоДепозита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскогоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БрокерскогоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВедениеРеестраВладельцевИменныхЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеденияРеестра</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенСоглашениеПоДепозитнымВкладам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенСоглашениеПоКонверсионнымОперациям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДДУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоверительногоУправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорКуплиПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорСтрахования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнениеПравил</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Залога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаПогашениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоммунальныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомплексногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МировоеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОказанияАудиторскихУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственногоХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оценки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаПроведениеИдентификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поручительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрационногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбОтступном</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпецДепозитарногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпецРегистрационногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительствоНаСвоемУчастке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительствоНаЧужомУчастке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрудовойДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Цессии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/ПаевыеИнвестиционныеФонды/Forms/ФормаЭлемента/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ФОРМЫ

&НаКлиенте
Перем РеестрПайщиковИнициализирован;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();

	// установка отборов в динамическом списке контактных лиц
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(КонтактныеЛица.Отбор, "Объект",, ВидСравненияКомпоновкиДанных.Равно, Объект.Ссылка,
		Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	// отборы по ведомым регистрам
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.УсловияПравилПаевогоИнвестиционногоФонда.Отбор, "ПаевойИнвестиционныйФонд",,
		ВидСравненияКомпоновкиДанных.Равно, Объект.Ссылка, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.ДополненияПравил.Отбор, "Основание",,
		ВидСравненияКомпоновкиДанных.Равно, Объект.Ссылка, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.ДополненияПравил.Отбор, "ВидДоговора",,
		ВидСравненияКомпоновкиДанных.Равно, ПредопределенноеЗначение("Перечисление.ВидыДоговоров.ДополнениеПравил"), Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
	Если ЭтаФорма.Параметры.Свойство("ОткрытьНаСтраницеКонтактныеЛица") И ЭтаФорма.Параметры.ОткрытьНаСтраницеКонтактныеЛица Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаКонтактныеЛица;
	ИначеЕсли ЭтаФорма.Параметры.Свойство("ОткрытьНаСтраницеПравилаИЛицензия") И ЭтаФорма.Параметры.ОткрытьНаСтраницеПравилаИЛицензия Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПравилаИЛицензия;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИнициализироватьРеестрПайщиковЕслиОткрытаСтраница();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СОБЫТИЯ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СсылкаОбновитьНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Вопрос("Обновить текущий элемент?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		РаботаСВнешнимиСистемами.ОбновитьРеквизитыОбъектаИзМатрикс(Объект.Ссылка);
		
		ЭтаФорма.Прочитать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокСсылкиОбновить(ЭтаФорма, Объект.Ссылка);
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	РеквизитыПИФ = РегистрыСведений.РеквизитыПИФ.ПолучитьРеквизитыПИФ(Объект.Ссылка, ТекущаяДатаСеанса());
	ЗаполнитьЗначенияСвойств(ЭтаФорма, РеквизитыПИФ, "УправляющаяКомпания, ПолноеНаименованиеФонда");

КонецПроцедуры // ПриЧтенииСозданииНаСервере

&НаСервере
Процедура ИнициализироватьРеестрПайщиковНаСервере()
	
	РеестрПайщиков.Параметры.УстановитьЗначениеПараметра("Fund_Name", Объект.Наименование);
	
	УстановитьДоступныеДатыИОтборРеестраНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьРеестрПайщиковЕслиОткрытаСтраница()
	
	Если Элементы.Страницы.ТекущаяСтраница <> Элементы.СтраницаРеестрПайщиков
		Или РеестрПайщиковИнициализирован = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализироватьРеестрПайщиковНаСервере();
	РеестрПайщиковИнициализирован = Истина;
	
	Элементы.РеестрПайщиков.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ИнициализироватьРеестрПайщиковЕслиОткрытаСтраница();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступныеДатыИОтборРеестраНаСервере()
	
	// 1. Получаем список уникальных дат из внешнего источника с обработкой ошибок
	МассивДоступныхДат = ПолучитьСписокДатИзВнешнегоИсточникаНаСервере(Объект.Наименование);
	
	// 2. Настраиваем список выбора на форме
	НастроитьСписокВыбораДатыНаСервере(МассивДоступныхДат);
	
	// 3. Применяем отбор к списку
	УстановитьОтборПоДатеРеестраНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокДатИзВнешнегоИсточникаНаСервере(НаименованиеФонда)
	
	МассивДат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	dbo_Register_Of_Unit_Holders.Compilation_Date КАК ДатаСоставления
		|ИЗ
		|	ВнешнийИсточникДанных.Externals.Таблица.dbo_Register_Of_Unit_Holders КАК dbo_Register_Of_Unit_Holders
		|ГДЕ
		|	dbo_Register_Of_Unit_Holders.Fund_Name = &Fund_Name
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСоставления УБЫВ";
	
	Запрос.УстановитьПараметр("Fund_Name", НаименованиеФонда);
	
	Попытка
		Результат = Запрос.Выполнить();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не удалось получить список дат из внешнего источника'") + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат МассивДат;
	КонецПопытки;
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДатаБезВремени = НачалоДня(Выборка.ДатаСоставления);
			МассивДат.Добавить(ДатаБезВремени);
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивДат;
	
КонецФункции

&НаСервере
Процедура НастроитьСписокВыбораДатыНаСервере(МассивДоступныхДат)
	
	Элементы.ДатаРеестраПайщиков.СписокВыбора.Очистить();
	Элементы.ДатаРеестраПайщиков.СписокВыбора.Добавить(Дата(1, 1, 1), НСтр("ru = '<Все даты>'"));
	
	ПоследняяДата = Неопределено;
	УникальныеДаты = Новый Соответствие;
	
	Для Каждого ТекДата Из МассивДоступныхДат Цикл
		
		Если Не УникальныеДаты.Получить(ТекДата) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		УникальныеДаты.Вставить(ТекДата, Истина);
		
		// Добавляем в выпадающий список
		ПредставлениеДаты = Формат(ТекДата, "ДЛФ=DD");
		Элементы.ДатаРеестраПайщиков.СписокВыбора.Добавить(ТекДата, ПредставлениеДаты);
		
		// Запоминаем самую первую (она же максимальная)
		Если ПоследняяДата = Неопределено Тогда
			ПоследняяДата = ТекДата;
		КонецЕсли;
		
	КонецЦикла;
	
	// 4. Устанавливаем в поле последнюю дату, если она есть, иначе - "Все даты"
	Если ПоследняяДата <> Неопределено Тогда
		ЭтаФорма.ДатаРеестраПайщиков = ПоследняяДата;
	Иначе
		ЭтаФорма.ДатаРеестраПайщиков = Дата(1, 1, 1);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоДатеРеестраНаСервере()
	
	ОтборСписка = РеестрПайщиков.Отбор.Элементы;
	
	// 1. Удаляем старые отборы
	РеестрПайщиков.Отбор.Элементы.Очистить();
	
	// 2. Если выбрана конкретная дата (не пустая и не "Все даты")
	Если ЗначениеЗаполнено(ЭтаФорма.ДатаРеестраПайщиков) 
		И ЭтаФорма.ДатаРеестраПайщиков <> Дата(1, 1, 1) Тогда
		
		ЭлементНачалоДня = ОтборСписка.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементНачалоДня.ЛевоеЗначение   = Новый ПолеКомпоновкиДанных("Compilation_Date");
		ЭлементНачалоДня.ВидСравнения    = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		ЭлементНачалоДня.ПравоеЗначение  = НачалоДня(ЭтаФорма.ДатаРеестраПайщиков);
		ЭлементНачалоДня.Использование   = Истина;
		ЭлементНачалоДня.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		ЭлементКонецДня = ОтборСписка.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементКонецДня.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Compilation_Date");
		ЭлементКонецДня.ВидСравнения     = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементКонецДня.ПравоеЗначение   = КонецДня(ЭтаФорма.ДатаРеестраПайщиков);
		ЭлементКонецДня.Использование    = Истина;
		ЭлементКонецДня.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаРеестраПайщиковПриИзменении(Элемент)
	УстановитьОтборПоДатеРеестраНаСервере();
КонецПроцедуры
